import 'models/code.dart';

List<Map<String, dynamic>> vodafoneCodesData = [
  {
    'sectionName': 'كل الكودات',
    'codes': [
      {
        'name': 'اﻧﺸﺎء رﻗﻢ ﺳﺮى فودافون كاش أول مرة',
        'code': '*9*#5',
      },
      {
        'name': 'تغير الرقم السري',
        'code': '*9*#2',
      },
      {
        'name': 'كود تحويل الأموال فودافون كاش',
        'code': '*9*#7',
      },
      {
        'name': 'كود فودافون كاش نسيان الرقم السري',
        'code': '*9*#12',
      },
      {
        'name': 'كود السحب من فودافون كاش ATM',
        'code': '*9*#22',
      },
      {
        'name': 'ﻟﻤﻌﺮﻓﺔ اﻗﺮب ﻣﻨﻔﺬ ﻟﻠﺴﺤﺐ اوالاﻳﺪاع',
        'code': '*9*#9',
      },
      {
        'name': 'ﺗﺒﺮع ﻟﻠﻤﺆﺳﺴﺎت اﻟﺨﻴﺮﻳﺔ',
        'code': '*9*#104',
      },
      {
        'name': 'دﻓﻊ ﻓﻮاﺗﻴﺮ و أﺷﺘﺮاﻛﺎت',
        'code': '*9*#105',
      },
      {
        'name': 'اﻟﺪﻓﻊ اون ﻻﻳﻦ',
        'code': '*9*#100',
      },
      {
        'name': 'اﺳﺘﻌﻼم ﻋﻦ رصيد فودافون كاش',
        'code': '*9*#13',
      },
      {
        'name': 'ﺷﺤﻦ رﺻﻴﺪ',
        'code': '*9*#10',
      },
      {
        'name': 'ﺷﺤﻦ ﻛﺎرت ﻓﻜﺔ 2 ﺟﻨﻴﻪ',
        'code': '*9*#200',
      },
      {
        'name': 'ﺷﺤﻦ ﻛﺎرت ﻓﻜﺔ 4 ﺟﻨﻴﻪ',
        'code': '*9*#400',
      },
      {
        'name': 'ﺷﺤﻦ ﻛﺎرت ﻓﻜﺔ 6 ﺟﻨﻴﻪ',
        'code': '*9*#600',
      },
      {
        'name': 'ﺷﺤﻦ ﻛﺎرت ﻓﻜﺔ 8 ﺟﻨﻴﻪ',
        'code': '*9*#800',
      },
    ]
  }
];

List<Map<String, dynamic>> orangeCodesData = [
  {
    'sectionName': 'كل الكودات',
    'codes':[
  {
    'name': 'استعلام عن الرقم',
    'code': '#119#',
  },
  {
    'name': 'الاستعلام عن الرصيد',
    'code': '#3#100#',
  },
  {
    'name': 'اشتراك باقات الانترنت',
    'code': '#100#',
  },
  {
    'name': 'اشتراك كول تون',
    'code': '9999',
  },
  {
    'name': 'الغاء الكول تون',
    'code': 'UNSUB',
  },
  {
    'name': 'رقم أنظمة اورنج',
    'code': '400',
  },
  {
    'name': 'خدمة عملاء اورنج',
    'code': '110',
  },
  {
    'name': 'خدمة العملاء من أي خط أرضي',
    'code': '16110',
  },
  {
    'name': 'خدمة عملاء اورنج بيزنس',
    'code': '250',
  },
  {
    'name': 'خدمة عملاء اورنج المميزين',
    'code': '2000',
  },
  {
    'name': 'الحصول على رمز الـ PUK',
    'code': '210',
  },
  {
    'name': 'خدمة First service لتحصيل فواتيرك',
    'code': '555',
  },
  {
    'name': 'معلومات الشحن',
    'code': '321',
  },
  {
    'name': 'طريقة شحن كارت اورنج',
    'code': '#رقم الكارت*102#',
  },
  {
    'name': 'شحن كارت اورنج لرقم آخر',
    'code': '#100#1#',
  },
  {
    'name': 'عروض أورانج',
    'code': '300',
  },
  {
    'name': 'تحويل الرصيد',
    'code': '400',
  },
  {
    'name': 'سلفنى شكرا',
    'code': '#2#100#',
  },
  {
    'name': 'كلمنى شكرا',
    'code': '#رقم التلفون*121#',
  },
  {
    'name': 'الغاء الرسائل الاخبارية',
    'code': 'unsub',
  },
  {
    'name': 'باقة online اون لاين 1',
    'code': '#41112#100#',
  },
  {
    'name': 'باقة online اون لاين 7.5',
    'code': '#41113#100#',
  },
  {
    'name': 'باقة online اون لاين 15',
    'code': '#41114#100#',
  },
  {
    'name': 'باقة online اون لاين 30',
    'code': '#41121#100#',
  },
  {
    'name': 'باقة online اون لاين 45',
    'code': '#41122#100#',
  },
  {
    'name': 'باقة online اون لاين 60',
    'code': '#41123#100#',
  },
  {
    'name': 'باقة online اون لاين 75',
    'code': '#41124#100#',
  },
]
  }
];

List<CodeSection> vodafoneCodes = vodafoneCodesData
    .map((sectionData) => CodeSection.fromJson(sectionData))
    .toList();

List<CodeSection> orangeCodes = orangeCodesData
    .map((sectionData) => CodeSection.fromJson(sectionData))
    .toList();
